# Combining Python, SQL DBs and AWS

## Aim: Connect to your DB on AWS through python, and execute queries.

# Using Python with MYSQL DB

In [2]:
# make sure we have the package installed
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/84/38/a46937918c640ff5cffb261b693f8bff1a0bc7958dee97874a9b27c36b61/mysql_connector_python-8.0.18-cp36-cp36m-macosx_10_13_x86_64.whl (4.5MB)
     |████████████████████████████████| 4.5MB 3.9MB/s eta 0:00:01     |████████▌                       | 1.2MB 1.3MB/s eta 0:00:03
Collecting protobuf>=3.0.0
  Downloading https://files.pythonhosted.org/packages/76/c2/08685ae86ee1f5a45839e779726640ba981e629da2999ebce17e62639c9a/protobuf-3.10.0-cp36-cp36m-macosx_10_9_intel.whl (1.4MB)
     |████████████████████████████████| 1.4MB 5.3MB/s eta 0:00:01
Requirement already satisfied: six>=1.9 in /Users/marshall132/anaconda3/lib/python3.6/site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.11.0)
Requirement already satisfied: setuptools in /Users/marshall132/anaconda3/lib/python3.6/site-packages (from protobuf>=3.0.0->mysql-connector-python) (38.4.0)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.18 protobuf-3.10.0

In [3]:
## importing 'mysql.connector' 
import mysql.connector

In [4]:
## Connecting to the database

## connecting to the database using 'connect()' method
## it takes 3 required parameters 'host', 'user', 'passwd'
cnx = mysql.connector.connect(
    host = "localhost",
    user = "root",
    passwd = "dbms"
)

DatabaseError: 2003 (HY000): Can't connect to MySQL server on 'localhost' (61)

### Documentation:

https://dev.mysql.com/doc/connector-python/en/connector-python-connectargs.html

## Using a config File:

You do not want to make your credentials viewable to everyone who might see this file.  So instead of explicity stating your credentials, we want to import them from another file.

In [5]:
import config

In [8]:
config.host

'flatiron.csnuj3rw9qjy.us-east-2.rds.amazonaws.com'

In [7]:
## Connecting to the database

## connecting to the database using 'connect()' method
## it takes 3 required parameters 'host', 'user', 'passwd'
cnx = mysql.connector .connect(
    host = config.host,
    user = config.user,
    passwd = config.password
)

print(cnx) # it will print a connection object if everything is fine

<mysql.connector.connection_cext.CMySQLConnection object at 0x105556a90>

In [10]:
cursor = cnx.cursor()

## SQL Commands: Data Definition Language Commands (DDL)
This section will discuss the commands through which you can define your database. The commands are as follows:

- CREATE
- DROP
- TRUNCATE
- ALTER
- BACKUP DATABASE

### CREATE

This statement is used to create a table or a database.

#### The ‘CREATE DATABASE’ Statement:
As the name suggests, this statement is used to create a database.

**Syntax**

`CREATE DATABASE DatabaseName;`

**Example**

`CREATE DATABASE Employee;`

#### The **‘CREATE TABLE’** Statement

This statement is used to create a table.

**Syntax**

`CREATE TABLE TableName (
Column1 datatype,
Column2 datatype,
Column3 datatype,
....
ColumnN datatype
);`

**Example**

`CREATE TABLE Employee_Info
(
EmployeeID int,
EmployeeName varchar(255),
Emergency ContactName varchar(255),
PhoneNumber int,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`

You can also create a table using another table. Refer the below sytax and example:

#### The ‘CREATE TABLE AS’ Statement
**Syntax**

`CREATE TABLE NewTableName AS
SELECT Column1, column2,..., ColumnN
FROM ExistingTableName
WHERE ....;`

**Example**

`CREATE TABLE ExampleTable AS
SELECT EmployeeName, PhoneNumber
FROM Employee_Info;`

[MYSQL Data Types](http://www.mysqltutorial.org/mysql-data-types.aspx)

### DROP
This statement is used to drop an existing table or a database.

#### The ‘DROP DATABASE’ Statement
This statement is used to drop an existing database. When you use this statement, complete information present in the database will be lost.

**Syntax**

`DROP DATABASE DatabaseName;`

**Example**

`DROP DATABASE Employee;`

#### The ‘DROP TABLE’ Statement
This statement is used to drop an existing table. When you use this statement, complete information present in the table will be lost.

**Syntax**

`DROP TABLE TableName;`

**Example**

`DROP Table Employee_Info;`

### TRUNCATE
This command is used to delete the information present in the table but does not delete the table. So, once you use this command, your information will be lost, but not the table.

**Syntax**

`TRUNCATE TABLE TableName;`

**Example**

`TRUNCATE Table Employee_Info;`

### The ‘ALTER TABLE’ Statement
This statement is used to add, delete, modify columns in an existing table.

#### The ‘ALTER TABLE’ Statement with ADD/DROP COLUMN
You can use the ALTER TABLE statement with ADD/DROP Column command according to your need. If you wish to add a column, then you will use the ADD command, and if you wish to delete a column, then you will use the DROP COLUMN command.

**Syntax**
`ALTER TABLE TableName
ADD ColumnName Datatype;`

`ALTER TABLE TableName
DROP COLUMN ColumnName;`

**Example**

`ALTER TABLE Employee_Info
ADD BloodGroup varchar(255);`
 
`ALTER TABLE Employee_Info
DROP COLUMN BloodGroup ;`

#### The ‘ALTER TABLE’ Statement with ALTER/MODIFY COLUMN
This statement is used to change the datatype of an existing column in a table.

**Syntax**

`ALTER TABLE TableName
ALTER COLUMN ColumnName Datatype;`

**Example**
 
`ALTER TABLE Employee_Info
ADD DOB year;
ALTER TABLE Employee_Info
ALTER DOB date;`

### BACKUP DATABASE
This statement is used to create a full backup of an existing database.

**Syntax**
`BACKUP DATABASE DatabaseName
TO DISK = 'filepath';`

**Example**

`BACKUP DATABASE Employee
TO DISK = 'C:UsersSahitiDesktop';`

## SQL Commands: Constraints Used In Database
Constraints are used in a database to specify the rules for data in a table. The following are the different types of constraints:

- NOT NULL
- UNIQUE
- CHECK
- DEFAULT
- INDEX


### NOT NULL
This constraint ensures that a column cannot have a NULL value.

**Example**

 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`
 
NOT NULL on ALTER TABLE
 
`ALTER TABLE Employee_Info
MODIFY PhoneNumber int NOT NULL;`

### UNIQUE
This constraint ensures that all the values in a column are unique.

**Example**

UNIQUE on Create Table
 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL UNIQUE,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`
 
UNIQUE on Multiple Columns
 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255),
CONSTRAINT UC_Employee_Info UNIQUE(Employee_ID, PhoneNumber)
);`
 
UNIQUE on ALTER TABLE
 
`ALTER TABLE Employee_Info
ADD UNIQUE (Employee_ID);`
 
To drop a UNIQUE constraint
 
`ALTER TABLE  Employee_Info
DROP CONSTRAINT UC_Employee_Info;`

## Creating DB

In [11]:
from mysql.connector import errorcode

In [12]:
db_name = 'employees'

In [13]:
def create_database(cursor, database):
    try:
        cursor.execute(
            "CREATE DATABASE {} DEFAULT CHARACTER SET 'utf8'".format(database))
    except mysql.connector.Error as err:
        print("Failed creating database: {}".format(err))
        exit(1)

try:
    cursor.execute("USE {}".format(db_name))
except mysql.connector.Error as err:
    print("Database {} does not exists.".format(db_name))
    if err.errno == errorcode.ER_BAD_DB_ERROR:
        create_database(cursor, db_name)
        print("Database {} created successfully.".format(db_name))
        cnx.database = db_name
    else:
        print(err)
        exit(1)

Database employees does not exists.
Database employees created successfully.

### Creating tables

In [14]:
DB_NAME = 'employees'

TABLES = {}
TABLES['employees'] = (
    "CREATE TABLE employees ("
    "  emp_no int(11) NOT NULL AUTO_INCREMENT,"
    "  birth_date date NOT NULL,"
    "  first_name varchar(14) NOT NULL,"
    "  last_name varchar(16) NOT NULL,"
    "  gender enum('M','F') NOT NULL,"
    "  hire_date date NOT NULL,"
    "  PRIMARY KEY (emp_no)"
    ") ENGINE=InnoDB")

TABLES['departments'] = (
    "CREATE TABLE departments ("
    "  dept_no char(4) NOT NULL,"
    "  dept_name varchar(40) NOT NULL,"
    "  PRIMARY KEY (dept_no), UNIQUE KEY dept_name (dept_name)"
    ") ENGINE=InnoDB")

TABLES['salaries'] = (
    "CREATE TABLE salaries ("
    "  emp_no int(11) NOT NULL,"
    "  salary int(11) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,from_date), KEY emp_no (emp_no),"
    "  CONSTRAINT salaries_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['dept_emp'] = (
    "CREATE TABLE dept_emp ("
    "  emp_no int(11) NOT NULL,"
    "  dept_no char(4) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,dept_no), KEY emp_no (emp_no),"
    "  KEY dept_no (dept_no),"
    "  CONSTRAINT dept_emp_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE,"
    "  CONSTRAINT dept_emp_ibfk_2 FOREIGN KEY (dept_no) "
    "     REFERENCES departments (dept_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['dept_manager'] = (
    "  CREATE TABLE dept_manager ("
    "  dept_no char(4) NOT NULL,"
    "  emp_no int(11) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,dept_no),"
    "  KEY emp_no (emp_no),"
    "  KEY dept_no (dept_no),"
    "  CONSTRAINT dept_manager_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE,"
    "  CONSTRAINT dept_manager_ibfk_2 FOREIGN KEY (dept_no) "
    "     REFERENCES departments (dept_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['titles'] = (
    "CREATE TABLE titles ("
    "  emp_no int(11) NOT NULL,"
    "  title varchar(50) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date DEFAULT NULL,"
    "  PRIMARY KEY (emp_no,title,from_date), KEY emp_no (emp_no),"
    "  CONSTRAINT titles_ibfk_1 FOREIGN KEY (emp_no)"
    "     REFERENCES employees (emp_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

In [15]:
TABLES['employees']

"CREATE TABLE employees (  emp_no int(11) NOT NULL AUTO_INCREMENT,  birth_date date NOT NULL,  first_name varchar(14) NOT NULL,  last_name varchar(16) NOT NULL,  gender enum('M','F') NOT NULL,  hire_date date NOT NULL,  PRIMARY KEY (emp_no)) ENGINE=InnoDB"

In [16]:
for table_name in TABLES:
    table_description = TABLES[table_name]
    try:
        print("Creating table {}: ".format(table_name), end='')
        cursor.execute(table_description)
    except mysql.connector.Error as err:
        if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
            print("already exists.")
        else:
            print(err.msg)
    else:
        print("OK")

cursor.close()
cnx.close()

Creating table employees: OK
Creating table departments: OK
Creating table salaries: OK
Creating table dept_emp: OK
Creating table dept_manager: OK
Creating table titles: OK

## Inserting Data

In [17]:
#since we closed the connection, we need to reinstatiate it
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

In [23]:
# cursor = create_cnx()

In [18]:
from datetime import date, datetime, timedelta

tomorrow = datetime.now().date() + timedelta(days=1)

add_employee = ("INSERT INTO employees "
               "(first_name, last_name, hire_date, gender, birth_date) "
               "VALUES (%s, %s, %s, %s, %s)")
add_salary = ("INSERT INTO salaries "
              "(emp_no, salary, from_date, to_date) "
              "VALUES (%(emp_no)s, %(salary)s, %(from_date)s, %(to_date)s)")

data_employee = ('Geert', 'Vanderkelen', tomorrow, 'M', date(1977, 6, 14))

In [19]:
data_employee

('Geert',
 'Vanderkelen',
 datetime.date(2019, 10, 24),
 'M',
 datetime.date(1977, 6, 14))

In [20]:
cursor

In [21]:
# Insert new employee
cursor.execute(add_employee, data_employee)
emp_no = cursor.lastrowid

# Insert salary information
data_salary = {
  'emp_no': emp_no,
  'salary': 50000,
  'from_date': tomorrow,
  'to_date': date(9999, 1, 1),
}
cursor.execute(add_salary, data_salary)

# Make sure data is committed to the database
cnx.commit()

## Insert Many

cursor.executemany(operation, seq_of_params)

In [25]:
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

In [26]:
data = [
  ('Jane', date(2005, 2, 12)),
  ('Joe', date(2006, 5, 23)),
  ('John', date(2010, 10, 3)),
]
stmt = "INSERT INTO employees (first_name, hire_date) VALUES (%s, %s)"
cursor.executemany(stmt, data)

In [27]:
cnx.commit()

In [32]:
cursor.close()
cnx.close()

## Querying the DB

In [23]:
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

In [28]:

query = ("SELECT first_name, last_name, hire_date FROM employees "
         "WHERE hire_date BETWEEN %s AND %s")

hire_start = date(2005, 1, 1)
hire_end = date(2010, 12, 31)

cursor.execute(query, (hire_start, hire_end))

for (first_name, last_name, hire_date) in cursor:
  print("{}, {} was hired on {:%d %b %Y}".format(
    last_name, first_name, hire_date))

cursor.close()
cnx.close()

, Jane was hired on 12 Feb 2005
, Joe was hired on 23 May 2006
, John was hired on 03 Oct 2010

## Applied: Working with our student data

### Import our student data

In [29]:
import json

In [32]:


f=open('students.json','r')
data=json.load(f)

### Create a connection and cursor to AWS db

In [33]:
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

### Create a table for our student info

In [35]:
data[1]

{'birthplace': 'New York, NY',
 'dob': '1996-05-17',
 'favorite_food': 'Taiwanese beef noodle soup',
 'name': 'Rebecca Chi-May Weng',
 'siblings': 0,
 'years_in_nyc': 18}

In [38]:

create_query = """CREATE TABLE students
(student_id int(11) NOT NULL UNIQUE AUTO_INCREMENT,
name varchar(50) NOT NULL,
dob date NOT NULL,
birthplace varchar(50) NOT NULL,
siblings int(11) NOT NULL,
years_in_nyc float(3) NOT NULL,
favorite_food varchar(50) NOT NULL,
PRIMARY KEY (student_id))

"""

In [39]:
cursor.execute(create_query)

### Insert the student data into the table

In [42]:
data[0]

{'birthplace': 'Birmingham, AL',
 'dob': '1985-02-06',
 'favoritefood': 'oatmeal raisin cookies',
 'name': 'Sean Abu Wilson',
 'siblings': 2,
 'years_in_nyc': 8.4}

In [43]:
data[1]

{'birthplace': 'New York, NY',
 'dob': '1996-05-17',
 'favorite_food': 'Taiwanese beef noodle soup',
 'name': 'Rebecca Chi-May Weng',
 'siblings': 0,
 'years_in_nyc': 18}

In [54]:
#
student_list = []
for student in data:
    if 'favoritefood' in student.keys():
        student['favorite_food'] = student['favoritefood']
    student_tuple = (student['name'], student['dob'],  student['birthplace'], student['siblings'], student['years_in_nyc'], student['favorite_food'])
    student_list.append(student_tuple)

In [55]:
student_list

[('Sean Abu Wilson',
  '1985-02-06',
  'Birmingham, AL',
  2,
  8.4,
  'oatmeal raisin cookies'),
 ('Rebecca Chi-May Weng',
  '1996-05-17',
  'New York, NY',
  0,
  18,
  'Taiwanese beef noodle soup'),
 ('Charlie Schlinkert', '1994-06-11', 'Darien, Ct', 2, 7.2, 'Hamburgers'),
 ('Clare Blessen', '1994-08-10', 'Chicago, IL', 1, 2, 'cheese'),
 ('Dave Bletsch', '1982-04-29', 'New Hyde Park, NY', 2, 0.6, 'buffalo wings'),
 ('Eddie Pognon', '1994-04-26', 'Newark, New Jersey', 4, 22, 'pasta'),
 ('Findlay Bowditch', '1992-08-22', 'White Plains, NY', 2, 1, 'BBQ'),
 ('Gabriel Seemann', '1991-02-09', 'San Diego, CA', 3, 2.2, 'Falafel'),
 ('Garrett Keyes', '1993-09-20', 'New York City, NY', 0, 3.3, 'lamb vindaloo'),
 ('Jake Cohen', '1995-02-12', 'Philadelphia, PA', 1, 1.4, 'pizza'),
 ('JP Rinfret',
  '1990-08-02',
  'Manhasset, NY',
  2,
  5.6,
  'breaded chicken cutlets'),
 ('Kenny Miyasato', '1988-07-13', 'Lima, Peru', 0, 0, 'Pizza'),
 ('Kyle McNicoll', '1994-02-11', 'NYC', 1, 24, 'salmon sushi'),
 ('Marco Sanchez-Ayala',
  '1996-04-11',
  'Portland, OR',
  1,
  1.3,
  'cinnamon rolls'),
 ('Matthew R Finch', '1992-03-13', 'Detroit, MI', 1, 6, 'green curry'),
 ('melissa', 'December 4, 1987', 'Seattle, WA', 1, 6.5, 'coffee'),
 ('Michael Eby', '1991-01-03', 'St. Louis, MO', 1, 10, 'sandwiches'),
 ('Ravi Charan', '1992-07-07', 'Minneapolis, MN', 2, 5.181022, 'pandas'),
 ('Regina Ryan', '1991-10-08', 'Tashkent, Uzbekistan', 1, 12.4, 'noodles'),
 ('Samuel Diaz',
  '1987-09-21',
  'Harlem, NY',
  2,
  32,
  'Grilled Steak with Rice and Broccoli'),
 ('Sasha Epelbaum', '1996-10-05', 'NYC, NY', 1, 19, 'nyc bagels'),
 ('Stephanie Bourdeau', '1993-09-30', 'Brooklyn, NY', 2, 26.1, 'NYC pizza'),
 ('Wesley Willis', '1992-06-04', 'Detroit, MI', 4, 7, 'banana fritters'),
 ('Zoe Zhu', '1992-06-06', 'Shanghai, China', 0, 1.5, 'cinnamon toast crunch'),
 ('Christopher Shaw', '1982-11-11', 'Baltimore, MD', 0, 2.0, 'Italian Sub')]

In [58]:
insert_statement= """INSERT INTO students 
(name, dob, birthplace, siblings, years_in_nyc, favorite_food) 
VALUES (%(name)s,%(dob)s,%(birthplace)s,%(siblings)s,%(years_in_nyc)s,%(favorite_food)s)"""

In [59]:
cursor.executemany(insert_statement, data)

In [61]:
cnx.commit()
cursor.close()
cnx.close()

### Write queries to answer the following questions:

**Questions**
- Which student is the youngest?
- Which student's birthday is closest to the cohort's graduation date?
- Which student has the most siblings?
- How many students are only children?
- Which 3 students have lived in NYC the shortest amount of time?
- How many students are native New Yorkers?
- What are the most popular foods among the class?

[Utilizing the date data type in MySQL](http://www.mysqltutorial.org/mysql-date/)

In [122]:
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

In [84]:
### YOUNGEST STUDENT
stmt = """SELECT name, dob FROM students ORDER BY dob LIMIT 1"""
cursor.execute(stmt)
for name in cursor:
    print (name)

('melissa', None)

In [97]:
### CLOSEST BIRTHDAY TO GRADUATION DATE
stmt = """SELECT name, EXTRACT(MONTH FROM DOB) AS month, EXTRACT(DAY FROM dob) AS DAY FROM students 
GROUP BY name HAVING month BETWEEN 1 AND 2"""
cursor.execute(stmt)
for name in cursor:
    print (name)

('Sean Abu Wilson', 2, 6)
('Gabriel Seemann', 2, 9)
('Jake Cohen', 2, 12)
('Kyle McNicoll', 2, 11)
('Michael Eby', 1, 3)

In [98]:
### SELECT STUDENT WITH THE MOST SIBLINGS
stmt = """SELECT name, siblings FROM students 
ORDER BY siblings desc LIMIT 1"""
cursor.execute(stmt)
for name in cursor:
    print (name)

('Eddie Pognon', 4)

In [108]:
### NUMBER OF STUDENTS THAT ARE ONLY CHILDREN
stmt = """SELECT COUNT(name) FROM students 
WHERE siblings = 0"""
cursor.execute(stmt)
for name in cursor:
    print (name)

(5,)

In [109]:
### 3 STUDENTS WHO HAVE LIVED IN NYC THE SHORTEST
stmt = """SELECT name, years_in_nyc FROM students ORDER BY years_in_nyc LIMIT 3"""
cursor.execute(stmt)
for name in cursor:
    print (name)

('Kenny Miyasato', 0.0)
('Dave Bletsch', 0.6)
('Findlay Bowditch', 1.0)

In [114]:
### NUMBER OF NATIVE NEW YORKERS IN CLASS
stmt = """SELECT COUNT(name) FROM students WHERE years_in_nyc > 10"""
cursor.execute(stmt)
for name in cursor:
    print (name)

(7,)

In [121]:
### MOST POPULAR FOOD
stmt = """SELECT favorite_food, COUNT(favorite_food) AS num FROM students 
GROUP BY favorite_food ORDER BY num DESC LIMIT 1"""
cursor.execute(stmt)
for name in cursor:
    print (name)

('pizza', 2)